improve readme and add changelog
